package training.yandex.contest2025.part56;

import java.io.*;
import java.util.ArrayList;
import java.util.List;

public class SolutionE {

   /*
        Феодальное государство представляет собой подвешенной дерево из nn вершин, являющихся городами. Вершина 00 — это столица, а для любого другого города известен город, которому он непосредственно подчиняется.

        В этом государстве широко распространены трансферы из феодального бюджета — какие-то города могут получать дотации из феодального бюджета, а какие-то платить дополнительные налоги. Для каждого города известен баланс с феодальным бюджетом, он может быть как положительным, так и отрицательным. С порочной практикой феодальных трансферов было решено покончить, но не всё так просто.

        Поскольку государство феодальное, то его руководитель не может просто взять и изменить налоги или дотации в определенном городе, ведь вассал моего вассала — не мой вассал. Однако, можно издать эдикт, который изменит баланс на 11 (увеличит или уменьшит) для всех городов, которые находятся в дереве подчинения от столицы до этого города. Тогда феодалы не будут расстраиваться, что руководитель изменил налоги для их подчиненного — для них налог изменится точно так же. Таким образом, можно выбрать путь в дереве подчинения от вершины 00 до любой вершины и с помощью эдикта изменить на 11 баланс во вершинах этого пути.

        Цель реформы — сделать баланс во всех городах равным нулю, используя наименьшее возможное количество изданных эдиктов.
        Формат ввода

        В первой строке дано целое число nn — количество вершин в дереве ( 1≤n≤1000001≤n≤100000).

        В следующих n−1n−1 строках дано по одному целому числу pipi​ — номер вершины, являющейся предком вершины ii ( 0≤pi<n0≤pi​<n, 1≤i<n1≤i<n). Гарантируется, что вам дано подвешенное дерево с корнем в вершине 00.

        В последней строке дано nn чисел — исходные значения в вершинах ( ∣ai∣≤100000∣ai​∣≤100000).
        Формат вывода

        Выведите единственное число — минимальное количество эдиктов, необходимых для проведения реформы.
        Пример
        Ввод
        Вывод

        3
        0
        0
        2 1 3

    */

    public static void main(String[] args) throws IOException {
        try (BufferedReader reader = new BufferedReader(new InputStreamReader(System.in));
             BufferedWriter writer = new BufferedWriter(new OutputStreamWriter(System.out))) {

            int n = Integer.parseInt(reader.readLine());
            List<List<Integer>> children = new ArrayList<>(n);
            for (int i = 0; i < n; i++) {
                children.add(new ArrayList<>());
            }

            for (int i = 1; i < n; i++) {
                int p = Integer.parseInt(reader.readLine());
                children.get(p).add(i);
            }

            String[] parts = reader.readLine().split(" ");
            int[] a = new int[n];
            for (int i = 0; i < n; i++) {
                a[i] = Integer.parseInt(parts[i]);
            }

            long totalEdicts = 0;
            for (int i = 0; i < n; i++) {
                long sum = 0;
                for (int child : children.get(i)) {
                    sum += a[child];
                }

                totalEdicts += Math.abs(-a[i] + sum);
            }

            writer.write(String.valueOf(totalEdicts));
            writer.newLine();
        }
    }
}
